<template>
  <div>
    <v-card-title>
          <h1  max-height="600">ТС на приемке по качеству июнь 2022</h1> 
     <v-spacer></v-spacer>
    <v-text-field
        v-model="search"
        append-icon="search"
        label="Search"
        single-line
        hide-details
      ></v-text-field>
    </v-card-title>

  <v-btn>
  <v-row justify="center">
    <v-dialog
      v-model="dialog"
      persistent
      max-width="600px"
    >
      <template v-slot:activator="{ on, attrs }">
        <v-btn
          color="primary"
          dark
          v-bind="attrs"
          v-on="on"
        >
          Open Dialog
        </v-btn>
      </template>

      <v-card>
        <v-card-text>
          <v-container>
            
          </v-container>
        </v-card-text>
        <v-card-actions>
          <v-spacer></v-spacer>
          <v-btn
            color="blue darken-1"
            text
            @click="dialog = false"
          >
            Close
          </v-btn>
          <v-btn
            color="blue darken-1"
            text
            @click="dialog = false"
          >
            Save
          </v-btn>
        </v-card-actions>
      </v-card>
    </v-dialog>
  </v-row>
  </v-btn>
  <v-card>

    <v-data-table
      :headers="headers"
      :items="desserts"
      :search="search"
    ></v-data-table>
  </v-card>

  </div>
</template>

<script>
  export default {
    
    data () {
      return {
        page: 1,
        pageCount: 0,
        itemsPerPage: 20,
        headers: [
          {
            text: 'ID',
            align: 'start',
            sortable: false,
            value: 'ID',
          },
          { text: 'ТС', value: 'ТС' },
          { text: '№ТС', value: 'nТС' },
          { text: '№Накладной', value: 'nНакладной' },
          { text: 'Дата отгрузки', value: 'ДатаОтгрузки' },
          { text: 'Поставщик', value: 'Поставщик' },
          { text: 'Отправитель', value: 'Отправитель' },
          { text: 'Место отправления', value: 'МестоОтправления' },
          { text: 'Направление', value: 'Направление' },
          { text: 'Получатель', value: 'Получатель' },
        ],
        desserts: [
          {
            ID: '34554',
            ТС: 'img',
            nТС: 'U2002505',
            nНакладной: 'ЭИ588798',
            ДатаОтгрузки: '27.07.20',
            Поставщик: 'Лен-Инвест',
            Отправитель: 'ООО "КЭЛ" (0556678888)',
            МестоОтправления: 'ЛЕНИНСК -КУЗНЕЦКИЙ_1',
            Направление: 'ЗСМК ОАО',
            Получатель: 'ЗСМК (05785874)',
          },
          {
            ID: '64554',
            ТС: 'img',
            nТС: 'U2002505',
            nНакладной: 'ЭИ984215',
            ДатаОтгрузки: '27.07.20',
            Поставщик: 'Втормет Красноярск (РУСАЛ ...',
            Отправитель: 'ОАО "РУСАЛ Братск" (053445...',
            МестоОтправления: 'КРАСНОЯРСК-СЕВЕРНЫЙ',
            Направление: 'ЗСМК ОАО',
            Получатель: 'ЗСМК (05785874)',
          },
          {
            ID: '34554',
            ТС: 'img',
            nТС: 'U2002505',
            nНакладной: 'ЭИ588798',
            ДатаОтгрузки: '27.07.20',
            Поставщик: 'Втормет Красноярск (РУСАЛ ...',
            Отправитель: 'ОАО "РУСАЛ Братск" (053445...',
            МестоОтправления: 'КРАСНОЯРСК-СЕВЕРНЫЙ',
            Направление: 'ЗСМК ОАО',
            Получатель: 'ЗСМК (05785874)',
          },
          {
            ID: '34554',
            ТС: 'img',
            nТС: 'U2002505',
            nНакладной: 'ЭИ588798',
            ДатаОтгрузки: '27.07.20',
            Поставщик: 'Втормет Красноярск (РУСАЛ ...',
            Отправитель: 'ОАО "РУСАЛ Братск" (053445...',
            МестоОтправления: 'КРАСНОЯРСК-СЕВЕРНЫЙ',
            Направление: 'ТЛС',
            Получатель: 'ТЛС (08745512)',
          },
          {
            ID: '34554',
            ТС: 'img',
            nТС: 'U2002505',
            nНакладной: 'ЭИ588798',
            ДатаОтгрузки: '27.07.20',
            Поставщик: 'Втормет Красноярск (РУСАЛ ...',
            Отправитель: 'ООО "КЭЛ" (0556678888)',
            МестоОтправления: 'ЛЕНИНСК -КУЗНЕЦКИЙ_1',
            Направление: 'ЗСМК ОАО',
            Получатель: 'ЗСМК (05785874)',
          },
          {
            ID: '34554',
            ТС: 'img',
            nТС: 'U2002505',
            nНакладной: 'ЭИ588798',
            ДатаОтгрузки: '27.07.20',
            Поставщик: 'Втормет Красноярск (РУСАЛ ...',
            Отправитель: 'ООО "КЭЛ" (0556678888)',
            МестоОтправления: 'ЛЕНИНСК -КУЗНЕЦКИЙ_1',
            Направление: 'ЗСМК ОАО',
            Получатель: 'ЗСМК (05785874)',
          },
          {
            ID: '34554',
            ТС: 'img',
            nТС: 'U2002505',
            nНакладной: 'ЭИ588798',
            ДатаОтгрузки: '27.07.20',
            Поставщик: 'Втормет Красноярск (РУСАЛ ...',
            Отправитель: 'ООО "КЭЛ" (0556678888)',
            МестоОтправления: 'ЛЕНИНСК -КУЗНЕЦКИЙ_1',
            Направление: 'ЗСМК ОАО',
            Получатель: 'ЗСМК (05785874)',
          },
          {
            ID: '34554',
            ТС: 'img',
            nТС: 'U2002505',
            nНакладной: 'ЭИ588798',
            ДатаОтгрузки: '27.07.20',
            Поставщик: 'Втормет Красноярск (РУСАЛ ...',
            Отправитель: 'ООО "КЭЛ" (0556678888)',
            МестоОтправления: 'ЛЕНИНСК -КУЗНЕЦКИЙ_1',
            Направление: 'ЗСМК ОАО',
            Получатель: 'ЗСМК (05785874)',
          },
          {
            ID: '34554',
            ТС: 'img',
            nТС: 'U2002505',
            nНакладной: 'ЭИ588798',
            ДатаОтгрузки: '27.07.20',
            Поставщик: 'Втормет Красноярск (РУСАЛ ...',
            Отправитель: 'ООО "КЭЛ" (0556678888)',
            МестоОтправления: 'ЛЕНИНСК -КУЗНЕЦКИЙ_1',
            Направление: 'ЗСМК ОАО',
            Получатель: 'ЗСМК (05785874)',
          },
          {
            ID: '34554',
            ТС: 'img',
            nТС: 'U2002505',
            nНакладной: 'ЭИ588798',
            ДатаОтгрузки: '27.07.20',
            Поставщик: 'Втормет Красноярск (РУСАЛ ...',
            Отправитель: 'ОАО "РУСАЛ Братск" (053445...',
            МестоОтправления: 'КРАСНОЯРСК-СЕВЕРНЫЙ',
            Направление: 'ЗСМК ОАО',
            Получатель: 'ЗСМК (05785874)',
          },
          {
            ID: '33554',
            ТС: 'img',
            nТС: 'U2002505',
            nНакладной: 'ЭИ588798',
            ДатаОтгрузки: '27.07.20',
            Поставщик: 'Втормет Красноярск (РУСАЛ ...',
            Отправитель: 'ОАО "РУСАЛ Братск" (053445...',
            МестоОтправления: 'КРАСНОЯРСК-СЕВЕРНЫЙ',
            Направление: 'ЗСМК ОАО',
            Получатель: 'ЗСМК (05785874)',
          },
          {
            ID: '34554',
            ТС: 'img',
            nТС: 'U2002505',
            nНакладной: 'ЭИ588798',
            ДатаОтгрузки: '27.07.20',
            Поставщик: 'Втормет Красноярск (РУСАЛ ...',
            Отправитель: 'ОАО "РУСАЛ Братск" (053445...',
            МестоОтправления: 'КРАСНОЯРСК-СЕВЕРНЫЙ',
            Направление: 'ЗСМК ОАО',
            Получатель: 'ЗСМК (05785874)',
          },
          {
            ID: '34554',
            ТС: 'img',
            nТС: 'U2002505',
            nНакладной: 'ЭИ588798',
            ДатаОтгрузки: '27.07.20',
            Поставщик: 'Втормет Красноярск (РУСАЛ ...',
            Отправитель: 'ОАО "РУСАЛ Братск" (053445...',
            МестоОтправления: 'КРАСНОЯРСК-СЕВЕРНЫЙ',
            Направление: 'ЗСМК ОАО',
            Получатель: 'ЗСМК (05785874)',
          },
          {
            ID: '34554',
            ТС: 'img',
            nТС: 'U2002505',
            nНакладной: 'ЭИ588798',
            ДатаОтгрузки: '27.07.20',
            Поставщик: 'Лен-Инвест',
            Отправитель: 'ООО "КЭЛ" (0556678888)',
            МестоОтправления: 'ЛЕНИНСК -КУЗНЕЦКИЙ_1',
            Направление: 'ЗСМК ОАО',
            Получатель: 'ЗСМК (05785874)',
          },
          {
            ID: '34554',
            ТС: 'img',
            nТС: 'U2002505',
            nНакладной: 'ЭИ588798',
            ДатаОтгрузки: '27.07.20',
            Поставщик: 'Лен-Инвест',
            Отправитель: 'ООО "КЭЛ" (0556678888)',
            МестоОтправления: 'ЛЕНИНСК -КУЗНЕЦКИЙ_1',
            Направление: 'ЗСМК ОАО',
            Получатель: 'ЗСМК (05785874)',
          },
          {
            ID: '34554',
            ТС: 'img',
            nТС: 'U2002505',
            nНакладной: 'ЭИ588798',
            ДатаОтгрузки: '27.07.20',
            Поставщик: 'Лен-Инвест',
            Отправитель: 'ООО "КЭЛ" (0556678888)',
            МестоОтправления: 'ЛЕНИНСК -КУЗНЕЦКИЙ_1',
            Направление: 'ЗСМК ОАО',
            Получатель: 'ЗСМК (05785874)',
          },
          {
            ID: '34554',
            ТС: 'img',
            nТС: 'U2002505',
            nНакладной: 'ЭИ588798',
            ДатаОтгрузки: '27.07.20',
            Поставщик: 'Лен-Инвест',
            Отправитель: 'ООО "КЭЛ" (0556678888)',
            МестоОтправления: 'ЛЕНИНСК -КУЗНЕЦКИЙ_1',
            Направление: 'ЗСМК ОАО',
            Получатель: 'ЗСМК (05785874)',
          },
          {
            ID: '34554',
            ТС: 'img',
            nТС: 'U2002505',
            nНакладной: 'ЭИ588798',
            ДатаОтгрузки: '27.07.20',
            Поставщик: 'Лен-Инвест',
            Отправитель: 'ООО "КЭЛ" (0556678888)',
            МестоОтправления: 'ЛЕНИНСК -КУЗНЕЦКИЙ_1',
            Направление: 'ЗСМК ОАО',
            Получатель: 'ЗСМК (05785874)',
          },
        ],
        dialog: false,
      }
    },
  }
</script>

